class script(object):
    START_TXT = """سلام {} عزیز
من ربات جست و جوی کانال سینمای هند هستم و با استفاده از من میتونی راحت خیلی از فیلمها،موزیک ویدیوها یا موسیقی ها رو بدون دخالت ادمین واسه خودت بارگذاری کنی و دانلود کنی😍🔥"""
    HELP_TXT = """اینجا بخش راهنمای منه☺️"""
    ABOUT_TXT = """
✯سازنده:شــروین
✯خونه زندگیم:<a href=https://t.me/indiancnemagap>گپ سینمای هند</a>
✯حرف و حدیثی با ما:<a href=https://t.me/kobiii1997>ادمـین</a>
✯وبسایت ما:در حال ساخت"""
    SOURCE_TXT = """<b>کانال:</b>
<a href=https://t.me/indiancnema>سینمای هند</a>  

<b>گپ:</b>
- <a href=https://t.me/indiancnemagp>نظرات کاربران</a>"""
    MANUELFILTER_TXT = """اینجا بخش راهنمای منه☺️

برای جست و جوی <b>فیلم</b>،<b>موزیک ویدیو</b> یا حتی <b>موسیقی</b> کافیه اول عضو کانال و بعد عضو گپ بشی،اسم فایل نظر خودتو (به لاتین) تایپ کنی و بفرستی و تموم،در صورت موجود بودن در کسری از ثانیه برات بارگذاری میشه،البته دیتابیس ما فعلا کالکشن سه خان بزرگ بالیوود رو پشتیبانی میکنه ولی به مرور کالکشن های سایرین هم اضافه خواهند شد🔥 """
    BUTTON_TXT = """راهنمای: <b>روش دوم</b>

<code>در گپ علامت @ رو تایپ کن،من رو انتخاب کن و بعد اسم فیلم مورد نظرتو سرچ کن و بعد از بین فیلمهایی که برات پیدا کردم انتخابش کن تا سریعا برات بارگذاری شه🔥😌</code>"""
    AUTOFILTER_TXT = """راهنمای: <b>IMDB</b>

<code>اگر گزینه آی ام دی بی رو ادمین فعال کرده باشه،با فرستادن اسم مورد نظرت میتونم اطلاعاتش رو بهت بدم </code>"""
    CONNECTION_TXT = """راهنمای: <b>بن</b>

<code>ادمین ها میتونن برای بن کردن کاربر(در زمینه استفاده از من) کامند بن+یوزر نیم کاربر رو برام بفرستن،</code>"""
    EXTRAMOD_TXT = """راهنمای: <b>اطلاعات کاربران</b>

<code>با ریپلای کردن پیام کاربر و وارد کردن دستور /id میتونم یوزر آیدیشو بهت بدم که برای همه اعضای چنل هم آزاده</code>"""
    ADMIN_TXT = """راهنمای: <b>سایر اطلاعات (مخصوص ادمین ها)</b>

<code>اطلاعات یوزدها،گپ ها،فایل های دیتا بیس،بن شده ها و غیره توسط سازنده براتون ارسال میشه</code>"""
    STATUS_TXT = """★ فایل ها: <code>{}</code>
★ کاربران: <code>{}</code>
★ گپها: <code>{}</code>
★ استفاده شده: <code>{}</code> 𝙼𝚒𝙱
★ باقی مانده: <code>{}</code> 𝙼𝚒𝙱"""
    LOG_TEXT_G = """#NewGroup
Group = {}(<code>{}</code>)
Total Members = <code>{}</code>
Added By - {}
"""
    LOG_TEXT_P = """#NewUser
ID - <code>{}</code>
Name - {}
"""
